2-SEMESTRE/Programação Web/AP2 PW/www/codeigniter4/app/Controllers/Admin/Client.php

    public function listClients(){
        $ClientModel = new ClientModel();
        $data = [
            'arrayClients'=>$ClientModel->findAll()
        ];
---
SELECT *
FROM `clients`

    public function listContacts(){
        $ContactModel = new ContactModel();
        $data = [
            'arrayClients'=>$ContactModel->findAll()
        ];
---
SELECT *
FROM `contacts`